fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ЕжемесячнаяАбонентскаяПлата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботыСпециалиста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДобавитьНовыеРеквизитыФормы();
	ДобавитьНовыеЭлементыФормы();  
	
КонецПроцедуры 

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) 
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		
		//Перенести период в элемент справочника
		ТекущийОбъект.ВКМ_ДатаНачалаДействияДоговора =	ЭтотОбъект.ПериодДействияДоговора.ДатаНачала;
		ТекущийОбъект.ВКМ_ДатаОкончанияДействияДоговора = ЭтотОбъект.ПериодДействияДоговора.ДатаОкончания;
		
	Иначе
		
		ОчиститьРеквизитыДоговора(ТекущийОбъект);
		
	КонецЕсли ; 
	
КонецПроцедуры

#КонецОбласти    

   
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	УстановитьВидимостьНовыхЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ДобавитьНовыеРеквизитыФормы()

	//Добавить реквизит ПериодДействияДоговора (Для удобства ввода дат)
	ДобавляемыеРеквизиты = Новый Массив;
	Реквизит_ПериодДействияДоговора = Новый РеквизитФормы("ПериодДействияДоговора",	Новый ОписаниеТипов("СтандартныйПериод")); 
	ДобавляемыеРеквизиты.Добавить(Реквизит_ПериодДействияДоговора);
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);  
	
	// Заполнить период согласно дат действия договора
	ЭтотОбъект.ПериодДействияДоговора.ДатаНачала = НачалоДня(Объект.ВКМ_ДатаНачалаДействияДоговора);
	ЭтотОбъект.ПериодДействияДоговора.ДатаОкончания = КонецДня(Объект.ВКМ_ДатаОкончанияДействияДоговора);	
	
КонецПроцедуры   

&НаСервере
Процедура ДобавитьНовыеЭлементыФормы()
	    
    СоздатьГруппуПрограммныхЭлементов();
    ДобавитьПоляДоговора();
    Элементы.ВидДоговора.УстановитьДействие("ПриИзменении", "ВидДоговораПриИзменении");
    УстановитьВидимостьНовыхЭлементовФормы(ЭтотОбъект);
    
КонецПроцедуры

&НаСервере
Процедура СоздатьГруппуПрограммныхЭлементов()
	
    Если Элементы.Найти("ГруппаПрограммноСозданныеЭлементыФормы") = Неопределено Тогда
        Группа = Элементы.Добавить("ГруппаПрограммноСозданныеЭлементыФормы", Тип("ГруппаФормы"), ЭтотОбъект);
        Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
        Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
        Группа.ОтображатьЗаголовок = Ложь;
        Группа.Отображение = ОтображениеОбычнойГруппы.Нет; 
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ДобавитьПоляДоговора()
	
    Поля = Новый Массив;
    Поля.Добавить(Новый Структура("Имя, Путь, Заголовок", 
        "АбонентскаяПлата", "Объект.ВКМ_ЕжемесячнаяАбонентскаяПлата", "Ежемесячная абонентская плата"));
    Поля.Добавить(Новый Структура("Имя, Путь, Заголовок", 
        "СтоимостьЧасаРаботы", "Объект.ВКМ_СтоимостьЧасаРаботыСпециалиста", "Стоимость часа работы специалиста"));
    Поля.Добавить(Новый Структура("Имя, Путь, Заголовок", 
        "ПериодДействияДоговора", "ПериодДействияДоговора", "Период действия договора"));
    
    Для Каждого ОписаниеПоля Из Поля Цикл
        Если Элементы.Найти(ОписаниеПоля.Имя) = Неопределено Тогда
            НовыйЭлемент = Элементы.Добавить(ОписаниеПоля.Имя, Тип("ПолеФормы"), 
                Элементы.ГруппаПрограммноСозданныеЭлементыФормы);
            НовыйЭлемент.ПутьКДанным = ОписаниеПоля.Путь;
            НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
            НовыйЭлемент.Заголовок = ОписаниеПоля.Заголовок;
        КонецЕсли;
    КонецЦикла;
    
КонецПроцедуры

&НаСервере
Процедура ОчиститьРеквизитыДоговора(ТекущийОбъект)
	
    ПустаяДата = Дата(1,1,1);
    ТекущийОбъект.ВКМ_ДатаНачалаДействияДоговора = ПустаяДата;
    ТекущийОбъект.ВКМ_ДатаОкончанияДействияДоговора = ПустаяДата;
    ТекущийОбъект.ВКМ_ЕжемесячнаяАбонентскаяПлата = 0;
    ТекущийОбъект.ВКМ_СтоимостьЧасаРаботыСпециалиста = 0;
    
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьНовыхЭлементовФормы(Форма)     
		
	Форма.Элементы.ГруппаПрограммноСозданныеЭлементыФормы.Видимость = Форма.Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание");		
			
КонецПроцедуры

#КонецОбласти
